{"title": "Peaky Blinders", "poster_url": "https://m.media-amazon.com/images/M/MV5BZjYzZDgzMmYtYjY5Zi00YTk1LThhMDYtNjFlNzM4MTZhYzgyXkEyXkFqcGdeQXVyMTE5NDQ1MzQ3._V1_QL75_UY74_CR5,0,50,74_.jpg", "release_year": "30 Sep 2014", "plot": "A gangster family epic set in 1900s England, centering on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby.", "genre": "Crime, Drama", "director": "N/A", "cast": "Cillian Murphy, Paul Anderson, Sophie Rundle", "imdbRating": "8.8", "reviews": {"Peaky Blinders is a tale that is extremely loosely based on an actual English gang in the 19th century. It's a story about anti-heroes, characters who you'd despise in real life, but who also generate feelings of sympathy from the audience. It's such a well made show, very engaging, and there's just something so special about it that makes it irresistible. I even tried to lose interest at one point, but found myself longing for more, I had to continue. And Cillian Murphy just kills it. He has proven he is lead-character worthy.Do yourself a favor and give this show a chance. It's well deserving of that. It's full of great acting, interesting plot developments, and fantastic camerawork. Be warned, you might find yourself a bit obsessed with it as well.": "Positive", "(Review updated after Season 6).Birmingham, England, 1919. In the aftermath of WW1, the Shelby family are making a name for themselves as bookmakers, racketeers and gangsters. Nominally the head of the family is the oldest brother, Arthur, but the real brains, ambition and drive in the organisation lies with Tommy, the second oldest. He will carve out an empire for himself that will stretch beyond Birmingham. This with the aid of his family and his gang, the Peaky Blinders.Superb drama, created and written by Steven Knight. Gritty, realistic, intriguing and highly entertaining. Some great machinations, subterfuges, plots and counter-plots plus a good amount of action and human drama. Think The Sopranos set in the UK in 1919.Some very clever storylines and plot developments. They sometimes threaten to become implausible and random (especially as the series goes on) but have a way of fitting together and all making sense at the end.Great work by the main performers: Cillian Murphy, Helen McCrory, Paul Anderson, Sophie Rundle and Joe Cole. The secondary/guest performances include some big names: Sam Neill, Tom Hardy, Aiden Gillen, Adrien Brody, Noah Taylor. Tom Hardy is the pick of the bunch, as Alfie Solomons.Great soundtrack too. Though set in the early-20th century, the music is mostly rock, and it works. Despite being anachronistic, the music works, giving the series an edgy feel. It starts with the theme track - Nick Cave's excellent 'Red Right Hand', a song that seems to fit Tommy Shelby perfectly. It continues with the scene-specific music and includes some great tracks. For example, in one episode alone you have Radiohead's 'Climbing Up The Walls', Joy Division's 'Atmosphere' and Black Sabbath's 'War Pigs'.In addition, the show went out on a high, while it was still quality viewing. By Season 5 cracks were starting to appear: the plot in Season 5 was a bit loose and unfocused and ends rather clumsily, compared to previous seasons. Still great, but not as good as previous seasons and a sign that it had run its course.The worry then was that Steven Knight would just phone it in for a few seasons to milk more money out of it and just end up ruining the legacy of the show. However, Season 6 is a great finale: focused, short and sharp, wrapping things up in style.": "Positive", "Peaky Blinders is not only one of the most underrated TV shows of all-time but it's also one of the greatest shows of all-time! It's even better than all the hype and love it gets as more and more people are watching it and loving it! It's quickly becoming one of the better shows ever created! If you want to see how loved this show really is all you have to do is read through some of the reviews or look at the ratings. It's one of the rare shows where every season is just as great as the others! If you haven't seen this amazing show yet then do yourself a favor &amp; go watch it immediately!": "Positive", "One of the very well made british drama I have seen in TV Series. Compelling story telling with some really great acting lead by Cillian Murphy and the series that excels in all the other department...acting, direction, story, screenplay and the cinematography.": "Positive", "I'm late to the party here as I have been for anything appearing on network or cable TV since 'Seinfeld' went off the air. But it's gratifying in one way, as I've been able to watch the (so far) complete five seasons of \"Peaky Blinders\" over the course of a few weeks without losing a sense of continuity. I have to say, this is one of the best series I've seen, on a par with shows like HBO's \"Deadwood\" and \"Carnivale\", though this one comes courtesy of Netflix and the BBC. The acting is impeccable, with a strong cast led by Cillian Murphy as the notorious Tommy Shelby, leader of the Peaky 'effing' Blinders, as the characters manage to remind us in just about every episode. Without knowing what the title refers to, it becomes clear in a fourth season episode I think, when Finn Shelby (Harry Kirton) earns his brotherly status in the organization by using the razor blade in the peak of his cap to register his initiation murder for the gang. The machinations of the Shelby's are sometimes difficult to follow if you're not attentive, as their alliances and enemies have a way of criss-crossing from one side to another, but suffice it to say, the gypsy blood in the Shelby's generally manage a way to insure their triumph over perceived adversaries. The series is set in 1920's Birmingham, England, with the period detail strikingly imaginative and real. With not a weak actor in the ensemble, it's hard to pick a favorite among the killers and assassins who populate the story lines, but for whatever reason, I happen to take a shine to Harry Kirton as Shelby sidekick Johnny Dogs, who has just the right blend of malice and humor to appear as a well regarded henchman. It will be interesting to see where the story goes next with the start up of Season Six whenever it comes to pass. You can just about bet that there will be more than one instance that result in 'the bleak midwinter'.": "Positive", "This must be the best show that the BBC ever made. I absolutely love everything about this show. It is so refreshing compared to other new shows. The actors are all top notch. The constant battle between Cillian Murphy and Sam Neill is an absolute delight to watch. Helen McCrory as aunt Polly is another stunning performance. Annabelle Wallis is also very good. In fact every actor of this series is good. I can not fault anyone. The storyline with the dark industrial atmosphere form Birmingham post World War One all adds up to be one of the shows you can't dislike. The costumes and the surroundings are all perfect. It's like you took a time machine back to the beginning of the 20th century. Well done BBC, can't wait for the next season!": "Positive", "In Peaky Blinders we follow a family after the First World War that is always looking for power and money. But a policeman arriving at the city is looking to stop this family, but it's not easy. It will also be noticeable the segregated fight of ghettos like Italians, gypsies, local gangsters and Jews. Peaky Blinders is an excellent gangster drama full of rich, interesting and diverse characters. The fact that Peaky Blinders is a crime series can give the impression that characters are macho men. But this is not true. The series also incorporates many powerful female characters. It has an excellent cast and script. Thomas is a character who uses his strategic intelligence and applies violence to his own ends without hesitation. The film music is the highlight of the series along with Cillian Murphy and Tom Hardy. The director does resort to a modern soundtrack that reflects the fiction.It is estimated that one episode of the series is worth 1 million and 1.5 million euros. This means a rich, detailed and beautiful work of art. Constantly supporting the narrative structure visually, Peaky Blinders often touches upon the working conditions of the working class in Birmingham. Peaky Blinders, with a color scale that chooses to contrast between pale blues and greens, and contrasts with the shades of red, makes the strongest manifestation of emotions in the midst of this unknown, while attributing a distinct obscurity to Birmingham's misty air. Also, the visual effects used from time to time are quite clever. The visual effects used are also quite compatible with the historical theme of the series.Peaky Blinders makes each episode a separate action and drama. It's a breathtaking series where you can see the rise of Peaky Blinders. 9/10": "Positive", "Peaky Blinders is without a doubt one of my favorite tv shows of all-time. I wanted to watch this after seeing the trailers and then I heard so many people talking about how great this show was, everyone I know who saw it loved it so it raised my expectations even more. When a show is that hyped it rarely lives up to it. Well, this show not only met those expectations but surpassed them in every way possible. The acting and writing is what makes this show so special but the attention to detail they put into every aspect of this show is amazing. This series will hook you from the very first episode and hold on throughout the series. Give yourself enough time to watch this because you're going to want to binge it as quickly as you can.": "Positive", "Season One: 9/10Themes: Crime, Drama, Family, Post-War, Gangs, 19th Century, Romance, Suspense, Action &amp; Historical.Top three characters: 1) Polly Gray, 2) Thomas Shelby, and 3) Arthur Shelby.": "Neutral", "I have never seen so much beautiful series in my entire life, the actors are amazing, scenario is outstanding, the \"guest actors\" (Tom hardy) are amazing. I don't know what to say anymore, the series is a huge diamond. Cilliian Murphy and Paul Anderson, also aunt poly belongs to my heart. Must watch series.": "Positive", "It is been all said. This is must watch. Story telling is amazing the acting is outstanding.": "Positive", "Peaky Blinders is like a BBC-HBO co-production without HBO's involvement whatsoever; it has British television drama vibes running through its veins and it's got production values comparable to Martin Scorsese' Boardwalk Empire, because this show feels like a response to it. And what a response it is: a loud, violent and beautifully-made period drama telling a story of crime, justice and life in the shadows.This show's worth a go for any devotee of television drama anywhere.": "Positive", "/refers to Seasons 1-3/In general, I am not particularly fond of series depicting criminal gangs, as there is too much swearing and violence, wrong values are promoted via lifestyle glorification, etc. But as I have always liked Cillian Murphy, I decided to dedicate dozens of hours to watch this series in succession.The first episode was largely not too promising - the mood was too depressive, with WWI reminiscences, and it seemed that Murphy and Sam Neill would strongly dominate over other actors... But then it all changed and I grew steadily accustomed to the environment, location and period I am not very familiar with. Acting became a talented team work, and minor characters obtained their time and place to show their demand to be included into this sophisticated course of events. The rich cried too, and the famous died too - so one could not easily guess what would happen next. Additional points from me for the selection of music/songs, providing a deepening atmosphere to this not-so-bright life in the industrial town of Birmingham.Apparently, the biggest value of this series is realistic depiction of both the venue and characters; even the gangsters are no numb bullies, but persons capable of versatile strong feelings and deeds. And each action has its reasons - as well as consequences.So I am looking forward to new seasons already - Season 4 was strong again.PS Season 5 has apparently the most compact dialogs, Season 6 is a nice round-up - and with a nice twist in the end... The pace is somewhat slower and Murphy spends more time on screen alone, but still - a very strong series.": "Positive", "I was not expecting it to be this good,I really enjoyed all 4 episodes. The story is interesting,the acting is brilliant and the cinematography is just beautiful!I am eagerly waiting for the next episodes.When I compare Peaky Blinders to other popular TV shows that use sex,brutality and violence to shock the audiences and get high ratings(which they actually do)this sincere work is like needlework;fine,classy and detailed.The makers of this drama have not chosen the easy way,they have set off to make a first class period drama,that dares to be different.Cillian Murphy is at his best,I will even go as far as to say that this is one of the best performances I have seen of him.Sam Neil and Helen McCrory must be praised,all casting is perfect.Peaky Blinders sets high standards for other television dramas to follow.": "Positive", "Missed this highly regarded series when first broadcast some years ago but was encouraged to watch it by friends and caught up with series one over the festive period. Personally I had no knowledge of the gang-wars in post WWI Birmingham involving the Irish, gypsy and the local community, but found the story of middle brother Tommy Shelby's seemingly irresistible rise to kingpin status wholly involving and entertaining.It's easy to compare this drama with Scorsese's Hollywood take on the gangs of New York, but I hated that film with its cliched characterisations, violence just for violence sake depictions and some terrible over-acting, especially by Daniel Day-Lewis. There's very little of that in \"Peaky Blinders\" as it makes very few false-steps with a believable array of characters, carefully injected but not overdone scenes of brutality and convincing playing by its well-cast ensemble.Central to everything is the coming-man Tommy, played with cold-eyed efficiency by Cillian Murphy, usurping his older brother Arthur (Paul Anderson) in the process. There's a tearaway younger brother too and a sister who happens to love Tommy's one-time best pal, now a firebrand Communist agitator and a matriarchal aunt cannily played by Helen McCrory.The scene setting of the Birmingham slums, streets and factories is superbly done almost like a time machine has planted the viewer right there all those years ago. The linked stories of the six first episodes crescendo to a thrilling climax as Tommy takes on his established rival, a big-time racetrack bookie and takes in the involvement, make that entanglement with a pretty new Irish waitress who isn't all that she seems.However a senior police officer's mutual fascination with her was really the only missed step in the narrative especially its rather silly, overdone culmination at the conclusion of the first series finale but I now can't wait to further witness Tommy's inexorable rise in future series in what may be the best reason yet for binge-watching boxed sets to my knowledge.": "Positive", "In 1919, the notorious 'Peaky Blinders' are one of Birmingham, England 's most feared criminal gangs. Named after their practice of sewing razor blades into the peaks of their caps, the \"Peaky Blinders\" have interests in illegal betting, protection and the black market. Former war hero and brains behind the operation, Tommy Shelby, is eager to safeguard his family's success by making the business legitimate. But when he's offered a consignment of stolen arms, Tommy comes into direct conflict with Chief Inspector Campbell, a tough Belfast policeman who's been charged with recovering the guns at any cost.\nDirectors: Colm McCarthy, Tim Mielants, Otto Bathurst, Tom Harper, David Caffrey\nWriter: Steven Knight\nStarring: Cillian Murphy, Paul Anderson (XVIII), Sam Neill, Helen McCrory, Annabelle Wallis, Sophie Rundle\nThis show is one of the best crime drama series.The actors,the premise and the direction is really top notch.This show will transport you to England in the aftermath of World War I. And yeah Cellian Murphy is the best part of this show.The actor is great while portraying Thomas Shelby,the head of Peaky Blinders. A real treat for fans.": "Positive", "Peaky Blinders is all style and no substance. Endless slow-motion shots to dramatic music of characters walking, smoking cigarettes, or squinting into the distance. The priority is clearly to make everyone look cool: cool when they're engaging in brutal violence, cool when they're suffering or dying, cool when they're eating breakfast. Every shot is either like a music video or a fashion magazine spread in period costume. The characters are props - lifeless mannequins. None of them feel like actual people, nor are they meant to. The actors here are all good, but they have nothing to do but pose. We're just supposed to be dazzled by how cool they look and sound. The fact that so many viewers seem to think this show is gritty and realistic is a depressing commentary on how on we as a society can no longer tell the difference between the fake and the authentic (and how little we care about the difference). This show and others of its ilk (like the even more popular Taboo) are just nihilism photoshopped to look sexy. Superficially seductive, empty at the core.": "Positive", "Early on I loved this show. Eventually it is like watching the same episode over and over again. There is no depth of characters like we see in shows like Boardwalk Empire. Prior to watching season five I decided to watch season four again. The slow motion shots should go out the window at this point - it's just getting plain ridiculous. Add to that shots of characters parading into a room, with an air that they are the coolest people alive, like a teen given better clothes and a better hair cut on the first day of school - that is also really trying my patience. If I were asked what character recently portrayed on film annoyed me most I'd have a hard time thinking of anyone else but Arthur; if I was a Peaky Blinder I'd shoot him myself. But this is perhaps due to a good character, played by a good actor, that is irritating. Above all though, the vast majority of the music irritates me; could they not blend music of the time while retaining Nick Cave's intro and randomly chosen outros? Or how about the cliche parts where Tom never meets a woman that isn't ready to drop their panties for him - is this something that was borrowed from that awful show Entourage? And so, my struggle to get through season five goes forward. I've gone from a 9/10 at the end of season three, to a 7/10, and now to a 6/10. Wish me luck. Season six? No thanks.": "Positive", "'Peaky Blinders' season six *audible sigh*.This was by far the show I was most looking forward to this year. The final season of one of the best TV Shows ever put to screen. A show that had it all throughout its tenure, unbelievable acting leading to some of the most recognisable and iconic characters from the last decade of television. Long term storytelling that rivals most shows. A huge backlog of brilliant supporting characters that have carefully and meticulously been built up over the last five seasons of this show, amongst so much more. Sadly the writers seemed to forget about that for this final season, favouring to develop new characters (along with Tommy Shelby) that have very little impact on the overall plot whilst household names like Arthur Shelby (Paul Anderson) go backwards in regard to character development and Ada Thorne (Sophie Rundle) is barely on screen.It is very well-known that the tragic passing of series regular Helen McCrory (Polly Gray) is a notable reason for the assumed rewrites that had to take place before shooting. It is likely this was the reason for the reduction in screen time for expected main antagonist Michael Gray (Finn Cole) as their stories were intertwined with each other.Let's start with the main positive, the acting. Throughout all six seasons of this show the one consistent takeaway is the acting. After five seasons of playing the same character, Cillian Murphy clocked in one last time as the legendary Tommy Shelby, he bought the calm yet explosive nature that the character has adopted over the past five years. The big surprise for me this year was Natasha O'Keeffe as Lizzie Stark. Her presence on the show was increased massively from previous seasons with a much larger focus being put on Tommy's immediate family. She really shines in the emotional moments from the season, which there are plenty scattered throughout. There are other good performances as well, none of which I think are as good as these two. The problem with some is that they're overshadowed by the confusing direction the writers decided to go in with that particular character.Let's discuss the writing. What happened? This show has been one of the more consistently brilliant and entertaining shows since its inception in 2013 but for some reason it seems that the writing went backwards and the show became boring in places. Many people (myself included) felt that the writing began to decline slightly last season (season five), it had become too political and that only increased this time round with the rise of the Nazi party before World War II and the introduction of characters like Jack Nelson (James Frecheville) and Diana Mitford (Amber Anderson). As previously mentioned, this show has always had a large collection of well-developed characters that have been backed by a great cast but they decided to push the key supporting ones to the background in favour of some other new ones that are instantly forgettable. Starting with the most confusing which is Conrad Kahn as Tommy's new illegitimate son 'Duke Shelby' (yes, I did have to look up his name because like most people I had forgotten it.) The character is fine, I guess. The actor does a good enough job, the reason this creative decision perplexes me is not directly about the character himself, it's the choice of promoting him more than a character who has been there since the start like Finn Shelby (Harry Kirton). The confusing nature of this is extenuated by the fact that these two characters occupy a very similar role in the show. They're both younger members of the family that have a lot to learn and both spend this season learning what it means to be a Shelby. That's why I don't understand them choosing to focus more on Duke than an established character like Finn.In my opinion, this season desperately needed more episodes. I understand that all previous seasons had six episodes so it makes sense for them to want to keep it consistent but they needed to make an exception this time round because there were too many characters and plot points that ended up with a dissatisfying ending. This would've allowed some characters to obtain more screen time that they desperately needed to be able to finish their respective stories and character arcs. The biggest example of this is Michael Gray. He had been set up, especially in season five, as the main antagonist. He had directly opposed Tommy as the head of the family and wanted to lead the Peaky Blinders into a new age. However, Michael was barely even in half of the episodes and had very little amount of screen time with Tommy Shelby resulting in a lack of growth for this storyline, which for me was the most intriguing one going into the season.Despite the numerous negatives that were apparent throughout, there were definitely other positives. One of which being the camera work. In previous season the camera work had always been solid but not really something to call home about but this year they really stepped it up with some lovely one-shot scenes to build tension and to reflect the feelings of the characters on scene. The cinematography also seemed to take a step up especially in the final episode. There are some beautiful visuals throughout which give the show a stylised perspective, something that we have never really had in this show. It is a welcome addition to the already stacked merits that this show has held over the years.In conclusion, as brilliant as this show has been for the past five years this season was a huge drop in quality. The misguided idea to focus on new characters over the originals that have unfinished arcs was confusing that genuinely doesn't make sense. The acting can only carry a show so far and at some point the writing needed to catch up and sadly it didn't. There are rumours that they're currently in pre-production for a spin-off film, I will of course watch it and am looking forward to it, hopefully they can rectify some of their mistakes here.7/10.": "Positive", "Certainly had potential, started very interesting, but it quickly became repetitive and boring.Too bad, because the cinematography is good and the actors are not bad. It is hard to take this show seriously, especially with such unlikable characters.The music is great, but it doesn't fit into the series at all. The show is interesting at times, but it is too pretentious and the dialogues are too modern.It started out interesting, the concept is intriguing, as well as the period in which the action takes place, but it soon became repetitive, with a lot of slow motion shots. In each episode we have a small video where people walk in slow motion and someone smokes.The characters are simply too modern at the time, their reactions and the topics they talk about are so unrealistic that the show would function better as a comedy.Some parts are hilarious, the series itself is so pretentious that it is impossible to take it seriously. The production and costume design are excellent, but the script is not at that level, it is typical for today's film production.Another pretentious show set in the past, with characters who act as if they are from the present day.": "Positive", "With its interesting premise and all the glowing reviews here, I decided to binge watch this series thanks to a Christmas present of a temporary Netflix subscription. I stopped watching midway through season two.A great performance by the always terrific Cillian Murphy could not keep me from losing interest due to the subpar writing, increasingly silly storylines, and the mostly deliberate but still annoying anachronisms.In post Great War UK, the mixed Irish/gypsy \"Shelby\" family led by two war veteran brothers, \"Arthur\" (Paul Anderson) and \"Thomas\" (Murphy) run various illegal rackets out of their Birmingham slum. Thomas, the smarter and more ambitious of the two, has plans to move their operation into the bigtime. That brings their gang, the Peaky Blinders, into conflict with rival gangs, the IRA, the Bolsheviks, and the authorities. The latter is represented by \"Inspector Campbell\" (Sam Neill) a ruthless Ulsterman given carte blanche to bring the others to heel.A portrayal of a British street gang circa 1919 in a non-London city led by traumatized WW1 vets seems like a neat idea. However, I lost interest as the story became more and more farfetched. (The authorities are evil, evil, evil!) Or became irritated by the writers' politics: the IRA, who in 1919 were justly fighting for independence, are portrayed as creepy monsters, but the truly monstrous Bolsheviks are portrayed as misguided but still sympathetic and heroic. Or became annoyed at the poorly constructed characters. Thomas, who is supposed to be a Machiavellian criminal mastermind, is portrayed as a complete dupe as to the police informer in his midst. (\"How can you not see this, you dope!?!?\")And then you have the anachronisms. Most of them are deliberate. It appears the creators decided that 1920's England wasn't \"hip\" enough. So, they decided to give it some modern dressings to presumably make it more palatable to 21st century viewers. The soundtrack is filled with a who's who of hipster fav musicians: Tom Waits, The White Stripes, Johnny Cash, PJ Harvey, and Nick Cave. It's meant to be jarring to hear songs by these modern artists being played over 1920's scenes, but it doesn't make it any less annoying. So is the execrable dialogue which appears to be have been written by someone who's watched \"Snatch\" too many times. All the characters talk and act like they stepped-out of a Guy Ritchie film. Every sentence is punctuated by what Patrick Star would call \"spicy sentence enhancers.\" In other words, they drop the f-bomb after every other word. Even \"posh\" lady characters do. Trying to recreate how people talked a hundred years ago is hard work for both writers and actors, and it's clear the writers of \"Peaky Blinders\" didn't want to do that work. So, we get a lazy 21st century British crime drama with 1920's costumes and sets.And even more anachronisms. The most annoying character was \"Grace\" (Annabelle Wallis). Poorly written and acted. However, what annoyed me the most about her was her hair. For a show that went to great lengths to get costumes and men's hairstyles right, Grace's hairstyle screams 2013. No woman in 1919 would walk around in public with loose hanging, shoulder length hair. She looks so out-of-place. Is there a reason why she and the other actresses (although Wallis's is the most blatant) do not wear period appropriate hairstyles?After Mr. Murphy, the next best performance is by Sam Neill sporting an Ulster accent. Sadly, his character became more and more ridiculous as the writers grasped at storylines. One of the more absurd was his announcement of romantic feelings for a character young enough to be his daughter. Where did that come from? His character reminded me of the one played by Michael Shannon in HBO's \"Boardwalk Empire\" who also went off the rails due to poor writing. And speaking of age, Inspector Campbell is repeatedly shamed for not having served in WW1. Mr. Neill was 66 yrs old at the time he filmed season one and presumably his character is the same age. As desperate as the Empire was for bodies for the trenches, men in their 60's were not wanted even if they volunteered. Smug ignorance on the part of the writers to think otherwise. A petty complaint, but just one of many annoyances that led to me saying, \"No mas!' to \"Peaky Blinders.\"": "Negative", "The show is great for the first 2 seasons. Season 3 is watchable. Season 4 is disappointing and season 5 is unbearable.Don't get me wrong. Acting, costumes and filmography is still great but the script is weak. Full of cliche, every episode is so obvious, repeating the same story differently. Sometimes I even feel that I have seen the same scene before on another episode or season.It's like taking a 3 to 4 season masterpiece and stretching it as much as you can.": "Positive", "It started off good and continued good through the middle but the end was weak. I hope the writers put more pizzazz in season 5. Looking forward to a few more installments of this series. I think the people responsible for the scenery and costumes deserve an A+. Also would be interesting to know how they make the sky look so gray and drab which I'm sure it did in real life.": "Positive", "I wanted to like this show give how many people praise it, but having seen series as good as breaking bad, chernobyl, first half of game of thrones, better call saul, sopranos and others, this show is not among those actually good shows, but it is as good as, lets say westworld, though for entirely different reasons. Characters are solid, the acting is mostly good I specially like Hardy, but some characters like Polly are very inconsistent and becomes pretty annoying for no good reason other than to keep conflict going in the family. Everything is a little too dreamy plotwise and puts me off with a slight cringe from time to time, its a bit hard to care about the characters when they dont have enough depth, I think it just needs better planning to be what it wants to be, though overall it is good enough, I can appreciate the level of production it has and is undoubtly better than many other shows out there, just not quite among the best, I am very surprised it has an 8.8 average at this point, its more like an 8.4": "Positive", "It's a great series, I loved it. Everything about it was so great, the acting the writing, the directing etc. It drew me in from the first few episodes. The characters are attractive and likeable despite of course the role they play in the series. The series give you an insight on England in the 1920,30s and a peek at some of the social and political conditions at the time. Cillian Murphy the actor portraying Tommy was so crucial for the huge success of this show, however the support of the rest of the cast was very important, for example Arthur Shelby gave this series a distinct flavor that without him it would have been much less interesting. I wanted the series to go beyond season 6. I was sad when it ended. I will miss watching it, miss the characters, being with them for so long, they became like friends.": "Positive"}, "sentiment": "Positive", "percentage": "92.0%", "color": "rgb(11, 241, 11)"}