{"title": "Skyfall", "poster_url": "https://m.media-amazon.com/images/M/MV5BMWZiNjE2OWItMTkwNy00ZWQzLWI0NTgtMWE0NjNiYTljN2Q1XkEyXkFqcGdeQXVyNzAwMjYxMzA@._V1_QL75_UX50_CR0,0,50,74_.jpg", "release_year": "09 Nov 2012", "plot": "James Bond's loyalty to M is tested when her past comes back to haunt her. When MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.", "genre": "Action, Adventure, Thriller", "director": "Sam Mendes", "cast": "Daniel Craig, Javier Bardem, Naomie Harris", "imdbRating": "7.8", "reviews": {"I first saw this with my family in a theatre in 2012.Revisited it recently on a dvd which I own.This is my all time fav Bond film.This is the twenty-third in the Bond series n the third to star Daniel Craig as James Bond.This time Bond returns to service after MI6's servers are hacked and M receives a taunting computer message moments before the MI6 building explodes.Inspite of failing a series of physical, medical, and psychological examinations, Bond returns to the field to pursue an assassin known as Patrice n to recover a stolen hard drive containing details of undercover agents which is in the hands of Patrice's employer, Raoul Silva, a cyberterrorist seeking revenge against those he holds responsible for betraying him.I love the pre credit scene in this one, the motorcycle chase on the rooftops is awesome, the train chase sequence is adrenaline filled n the scene at The Varda Viaduct is amazeballs.The climactic action is more old skool n filled with solid atmosphere.The title track along with the picturization n Bond's fall from The Varda Viaduct is very gothic like.The abandoned palatial house, the vast moors, the chapel, the secret passageway, the isolation n the sky almost touching the ground, is filled with top notch atmosphere.This time Bond faces Raoul Silva n lots of his henchmen n a komodo dragon.Bond also faces Patrice, a mercenary working for Silva.This time Bond gets to cool off with Naomie Harris, Tonia Sotiropoulou n Berenice Marlohe.In this movie, for the first n last time we get to see Moneypenny doing field work along with Bond and later how she opted for the iconic desktop work.": "Negative", "Having watched every James Bond film on the big silver screen since The Spy Who Loved Me in 1977.It was almost surreal to see Skyfall being made by an Oscar winning director, go on to win Oscars and become one of the top grossing films of all time. The billion dollar Bond.To think back in 1989, Licence to Kill could not compete with the likes of Batman, Indiana Jones or Lethal Weapon 2 in the US box office.Bond is presumed dead after a mission goes wrong in Istanbul as he tries to retrieve a hard drive containing a list of top agents. M is under pressure especially as it seems she is being targeted by an anonymous cyber terrorist who turns out to be a rogue agent Silva (Javier Bardem) who was once M's most effective spy.Skyfall celebrated 50 years of the Bond films in the cinemas. It also takes liberties with the messy timeline of the film series. Daniel Craig's novice spy from Casino Royale is now a disillusioned veteran, at one point told to call it a day.The film re-introduces some familiar characters after being away for a few films, a younger more hi-tech Q and a new Miss Moneypenny. There is also a new M hovering in the background. The film also references earlier Bond movies as part of its golden anniversary celebrations.Although the film contains international locations, breathtaking action, some sumptuous cinematography from Roger Deakins, it flags a bit in the middle when it needed an additional action sequence.What director Sam Mendes does bring is some character moments and making effective use of Judi Dench as she recites some Tennyson.Unusually for a Bond film, this must be the only occasion where the villain actually achieved all of his objectives!": "Positive", "\"He knows us. He's one of us. He comes from the same place as Bond, a place you say doesn't exist, the shadows.\" The world's greatest secret agent is back, but is the need for an agent outdated in today's modern world? After MI-6 is attacked and M (Dench) is brought under scrutiny by the government Bond (Craig) alone is left to find out who is behind the attack while M is trying to both help Bond and defend the need for an agency that has been compromised. I know that a review is really not needed here, being the 23rd Bond movie either you will watch it or not. I am a huge fan of the series and was really looking forward to this after hearing this is the best Bond movie yet. I have really loved the Craig movies but for some reason they never had the feel of a Bond movie to me, I wasn't sure what was missing but they didn't have the same feel. Knowing that they were re-booting the series I was lenient and with this one the re-boot is complete. This had much more of a feel of a classic Bond movie and by the end I was excited to see the next one. I got chills watching a few times and especially at the end. This had possibly the best opening and ending to a Bond movie ever. I could go on and on about this but I will just say if you love Bond you will love this, if you have never seen one then this one will make you a fan. Overall, From Russia With Love is my favorite Bond movie but this a very close second, and I think may be more re-watchable. I wanted to watch this one again as soon as the movie was over. I give this a very high A.": "Positive", "Since the site has 1164 reviews as of this writing I'll just throw in my own two cents.Two of the world's greatest actors, namely Judi Dench and Javier Bardem, lead the way here. Daniel Craig, I thought, turned in another strong performance as the droll fearless 007.There's also wonderful support from Ralph Fiennes, as the new Intelligence Chairman, Ben Whishaw as Q, Albert Finney as the caretaker Kincade, and Naomie Harris as Eve Moneypenny.I found the film to be filled with humor and the special effects terrific. The movie is also very capably directed by the accomplished British director Sam Mendes.Perhaps, my only criticism would be the grand finale which I felt was somewhat drawn out and could have shortened the 2 hour 23 minute duration.I was surprised at the very negative reviews on the first page of IMDb. I found, overall, this new Bond film to be a powerhouse and I thoroughly enjoyed it.": "Positive", "The best film in the era of Daniel Craig as James Bond. Supremely well acted. The best performances are by Craig, Dench and Bardem who are prize. Great action scenes, big issue that touches past Bond and M which little is known. Sam Mendes does a masterful job directing this installment of James Bond. Realmete with this film you can compare Danie Craig Sean Connolly.": "Positive", "It has been a long ride for the Bond series, since the creation of the character there have been 15 novels by Ian Fleming, plenty of spin-off novels, comics, cartoons and video games and the film series is now 50 years old. There have been an extraordinary 23 official films, but few as extraordinary as Skyfall.After a mission goes wrong in Istanbul, MI6 loses a hard drive containing a list of all NATO agents within terrorist cells, and James Bond (Daniel Craig) is presumed Killed in Action. M's (Judi Dench) competence is questioned and the Chairman of the Intelligence and Security Committee, Gareth Mallory (Ralph Fiennes) plans to replace her. Making matters worse, a cyber-terrorist targets MI6 and M personally, getting a hold of the list and causing an explosion within MI6's headquarters. An older, more damaged Bond then returns to duty to serve Queen and Country, having to prove he is in shape before going on the search to find the terrorist.Skyfall is a long-awaited film thanks to MGM's financial woes, but it delivers. Skyfall takes a darker approach as we've seen with the past couple films and it's very character driven, yet Sam Mendes and the screenwriters still provide a massive injection of fun. Like most Bond films, Skyfall starts with an incredible chase sequence in Istanbul and continues strongly from then on, including a very stylish silhouette fight in Shanghai. The action scenes sequences were pristinely shot and practical effects were at the forefront.A challenge for the Bond series has always been real-world relevance. The series has faced down all challenges, from the end of the Cold War to the War on Terror. Skyfall tackles the changing nature of espionage. MI6 is no longer the shadowy organisation that the British government denied existed; it has to face the realities of the 24-hour media age we live in and the democratic accountability that incurs.The nature of the threats have changed, Bond faces a cyber-terrorist and along with the new Q, both could cause more damage than Bond can. In the real world, we have seen what Anonymous is capable of and seen how the Stuxnet worm affected the Iranian nuclear program. But there is always a need for people in the field to investigate. As M says, she is scared of this new world because many of the West's enemies are now faceless and nationless, and this element can work in the series' favour. Versatility has always been a Bond hallmark, which is why it is so enduring.Skyfall also goes full circle for Bond, as the filmmakers reintroduce popular characters, gadgets and humour. In Casino Royale, Bond is a young man who is bold, arrogant and reckless but can get the job done; in Skyfall, Craig is playing an older Bond who is both physically and emotionally vulnerable.The idea of an older Bond was briefly touched on in the unofficial film Never Say Never Again, but that was more to accommodate a 52-year-old Sean Connery being in the role. In Skyfall there is actual thematic reasons behind it. Craig gives another excellent performance, cementing his reputation as both a great actor and a great Bond, and the script treats him more as a character than an archetype. Along with M's character arch, the film tackles a theme of facing the past so it can be cleansed.The casting of Javier Bardem was a coup for the series and we as Bond fans are rewarded with a great villain. Bardem makes out Raoul Silva to be a man with seemingly camp mannerisms, but the master planner has a very sinister delivery. He has a complex, tragic background but he is not like other Bond villains looking for control, world domination, money or even self-preservation: he simply wants revenge.Skyfall is a great milestone to celebrate Bond's 50th birthday on film, and the Easter eggs for fans aren't overbearing, but rather nice touches. The last anniversary Bond film, Die Another Day, was a disaster and regarded as one of the worst Bond films. It felt like it had to keep referencing the previous films. Skyfall features a few major references to previous Bond films: Bond getting injured (The World is Not Enough), Bond faking his death (You Only Live Twice), the gun that can only work with Bond's palm print (Licence to Kill) and a similar villain to the one in Goldeneye. But these are references you would want to find, not being forced upon you.Skyfall felt very much like end of one chapter and the start of a new one. Mendes and the writers were able to reintroduce many tropes of the Bond series and still give them a modern and believable twist. For a film that has a 143-minute running time (the second longest Bond film), Skyfall never felt like it dragged and it was an exciting, entertaining film.Please visit www.entertainmentfuse.com": "Negative", "This was a great new gift for the 50th anniversary of Eon Productions series. Directed by Sam Mendes, \"Skyfall' tells the story of exile secret agent, 007 AKA James Bond (Daniel Craig) having to come back to her majesty's secret service, when MI6 comes under attack by a mysterious and sadistic cyberterrorist villain Raoul Silva (Javier Bardem) who wants vengeance against Bond's supervisor, M (Judi Dench). Without spoiling the movie, too much, while, this spy film is not as gritty as the previous Daniel Craig's versions of James Bond movies, 2005's 'Casino Royale' &amp; 2008's 'Quantum of Solace'. 'Skyfall' does have all the gadgets and tools that longtime fans have come to see, such as intense well-paced action pieces, sexy suggestive long making &amp; great memorable supporting characters like Q (Ben Whishaw) and Eve (Naomi Harris) paying homage to the series' iconic status. However, if some of the criticism of the last two films, is how much similar, Daniel Craig's bond is to the Jason Bourne's series, both in lack of quip and exceptional martial-arts department. Then, this movie will get criticize for how familiar, beat points of the plot is to the comic book movie 2008's 'the Dark Knight', with a tiresome and beaten down hero, going after a superior, intelligent, villain with large explosion and double-trickery. Despite that, I have to say, the movie is thrilling from start to finished, even if they abandoned some well-worn formula plot threads like opening gun barrel. Still, I thought, the movie could had explain, some parts of the film, a lot better, like how in the hell, did James Bond able to survive the opening action sequence in Turkey!? His out of the blue unexplained presence, later in the film was a bit jarring. I get that it's supposed to represent the rebirth of Bond, but it felt like a cheap hook that something that an older Sean Connery film would do. Not a modern day movie, like this. Another thing, I didn't like about the film is the idea of him, having heavy petting time with a woman who just reveal that she was an ex-child sex slave in China. It was a bit disturbing and dirty. At least, he could had wait for a better time to do that, when it isn't awkward. However, that never happens, as the woman named Sévérine (Bérénice Marlohe) barely gets any screen time. Because of this, I found the love-interest in this film to be, one of the weakest parts of the film. I thought, they could had established, a lot more with her character rather than a disposable plot device/sex object. One other thing, I was deeply surprised that they abandoned, was the complexity of the subplot of the breaches list of security, in favor for a simpler plot of man wanting to kill his ex-boss. I found the detour to be, great. The unique 'Home Alone' booby traps ending was a barn-burning finale. I also like how, it finally debunked the James Bond code name theory. In the end, this movie was worthy as the last hurrah for Judi Dench as M, whom played the role, over 17 years old, since 1995's 'GoldenEye'. She was amazing. Javier Bardem as the antagonist was also great. He had the right amount of charm, and creep to pull this Oedipus complex role, off. Raoul Silva will indeed immediately rank, very high as one of Bond's greatest villains. As for James Bond, Daniel Craig pull off, another defining performance. I love that they show, that the agent does have some flaws and sense of vulnerability. Skyfall really provides him with the opportunity to showcase his ability as a great actor. He's brutal when he needs to be, and charming and suave when the situation arises. He also has the comedy chops, when the film, ask for it, like jumping out of an helicopter with Queen Elizabeth II, during the 2012's Summer Olympics opening ceremony, during marketing. It's a lot better than the straight-case brooding over serious, hero, we got in the previous movie. About the controversial homosexuality/bi tendencies of Bond. He's clearly doing that, just for show. Nothing to get work up, about. He's still, pretty straight-forward, at least, as the recent films goes on. Anyways, 'Skyfall' isn't a Bond movie, without a good, supporting cast. Like, I said before, the rest of the cast was OK, with Ralph Fiennes's Gareth Mallory and Naomi Harris's Eve, standing out. As for Albert Finney's short role as Kincad. He was alright in the ending, but how cool, would it, be, if the director's original choice, Sean Connery was given that part. Anyways, as far, as the movie looks, the cinematography was alright. It was gorgeous, but I seem, better from cinematographer, Roger Deakins. Some of the locations used in the film like Hashima Island, kinda does stand out. Still, I could do, without all that CGI added for the Scotland landscapes. As for the opening title sequence. It was very well done. Visually, it was nice to look at, but the opening theme music by British singer, Adele titled 'Skyfall', really took the cake. It was so beautifully sung. It was an excellent song, that it is worthy of the many awards that it took; including Best Original Song at the Oscar. Not be undone, but composer, Thomas Newman's soundtrack wasn't half bad, as well. Overall: 'Skyfall' is one of the best action movies I've ever seen. I thoroughly enjoy it. This 23rd film in the series is worth the title of 007. Author, Ian Fleming would be, so proud. Highly recommended.": "Positive", "Whenever going through the Tube I fantasized about sliding down the long and steep escalator and taking satisfaction in the masses envying me. Here James Bond (Daniel Craig in this third outing as 007) and the evil Silva (Javier Bardem) achieve this in the Tube, and it's one of the most impressive stunts in Skyfall.I would have achieved greater satisfaction if the movie (even in the DVD outtakes) had a scene where Bardem, channeling Anton Chigurh from No Country For Old Men, swiftly despatches the arrogant commuters who attempt to push him aside to reach their platform on time, e.g. the suited people who think they can push their way through (I guess their Jaguars are being serviced) or the grumpy old guy who gets angry because he missed his train, even though the next one will arrive in 3.01 minutes.The Scottish highland scenes are stunning, although I was surprised to learn Bond's mansion was actually constructed in Surrey, in the neighboring country of England!Gareth Mallory MP, the Chairman of the House of Commons Intelligence and Security Committee, becomes the new M. I wonder if the by- election caused by Gareth's resignation from Parliament was won by the Opposition or a third party? Political intrigue at its finest. Anyway Ralph Fiennes plays Gareth, and in 2007 he made huge news when it was reported he had a mile high tryst with Qantas Flight Attendant Lisa Robertson.": "Positive", "Bond 23 and 007 has to literally come back from the dead when a stolen hard-drive makes M (Dench) look bad at a time when a face from her past comes homing into blood thirsty view.There is one sure fire fact in cinema that nobody can dispute, that of there never ever being a James Bond film that all Bondphiles will agree on. From each corner of the spectrum will come arguments that said Bond film is not gritty enough, not fun enough, not enough sex, not enough action, not enough fantastical stunts and etc etc etc. Well that's fine of course, we all have our peccadilloes we prefer in our Bond movies, but we do live in different times now, the world has changed, and so has Bond. You may not get the ultimate Bond you want, but this is a 21st Century Bond and a new era of 007 is upon us, something which makes Skyfall even the more bolder and braver because it marks the 50th anniversary by blending the old with the new and mostly achieving brilliant results.Skyfall allows us to bathe in nostalgia whilst also forcing us to re- evaluate just where we are at in terms of our beloved super secret agent. One of the great things about this Bond is that there is a bubbling under current of time's importance delicately perched on each side of James Bond's shoulders. Is he (and M etc) outdated? Or is the future still in need of such operatives/organisations? Director Mendes and his team don't take any of the easy options that were clearly available to them to answer the question, they instead build a film around Bond and M as characters, embrace the traditions of the series and hit us hard in head and heart.The plot of Skyfall as written is simple, absolutely nailed on it is straight and true to Hollywood conventions, but what fills out the simple plot is a series of Bondian delights, thrills spills and emotionally splintered kills. The stunning pre-credits sequence sees Bond traverse the rooftops of Istanbul on a motorcycle and then fight on top of a speeding train. Only to then find himself expendable. Which leads to Daniel Kleinman's title credits sequence that is filled with ominous portents of death and blood, in turn backed by the wonderfully Bondian of old title song warbled by Adele. It's clear at this point that this Bond movie is nodding to traditional values whilst promising to deliver some emotional pain. And so it proves.A washed up Bond enters the fray, and he convinces, he's dishevelled, unshaven and unfit, but he's still a tough bastard who can drink hard and stare a scorpion down. He'll be back soon, we know this, and he will be in wonderful physical shape, and loyal to his surrogate mother for sure. Ah, but there's the adversary on the scene now, a villain to finally give Craig's Bond something to fret about. It's Javier Bardem's (perfect) Silva, a cyber terrorist with a shock of blonde hair, a nasty dental trick and a devilish sexiness that unnerves during an interrogation scene; to which Bond cheekily opens up some wink wink possibilities. There is other sexual tension in the film as well, not just a steamy shower scene, but the ongoing banter with Naomie Harris' (excellent) Eve that positively fizzes with smirking innuendo.But ultimately this comes down to the love between a man and a woman, the kind that is so different to the type that has so often underpinned a Bond movie. Bond will kill or be killed for M, and how marvellous to see a director really able to give Judi Dench the direction she so deserves, and Bond, in Craig's magnetic and gritty hands, responds in kind to deliver a last half hour as good as any in the 50 years of Bond on film. As we know, all turf is Bond's turf, but this time it really is HIS turf, and as a little back story comes seeping out, Bond gets to exorcise some demons whilst kicking considerable ass. Get ready Bondphiles, this has the emotional wallop only seen in the best Bond movies of old.All the Bondian trappings are still here, exotic locales, gorgeous women, speeding vehicles, fights, stupendous stunts, bizarre lairs and balls out machismo. It's also funny! I myself commented when reviewing Quantum of Solace that it was pretty ace as an action film, but for many it's not Bondian enough, and the truth of the matter is Bond still needs to have a degree of fun, no matter how grim and gritty the story line is. Thankfully Skyfall is often a blast, with Craig (surely convincing even the most stubborn of dissenters how good a Bond he is) having the confidence and skill to lace his Bond's macho broody instinct with a desert dry wit and shrug of the shoulders nonchalance. Other side of the camera the tech credits are high, with Deakins proving to be one of the aces in the pack. His capturing of vistas, be it a neon city scape or a mountainous valley, are eye delights, his colour tones are beautiful, I promise you, nobody these days does golden browns like Deakins.It's not the masterpiece that I or gazillions of others hoped for, and it does have flaws (new Q a bit too geeky safe, finale lacks a substantial battle with the villain) and it remains simple in plot, but it's Bond's birthday and the birthday boy has been done proud by the makers. It's a new era Bond for sure, but that most definitely isn't a bad thing, it knows its past and it now knows its future, and without doubt we all still know the name. 9/10": "Positive", "'Could we discuss the next part of your performance over that drink?' asks the glittering Severine (Berenice Marlohe) from a suave tuxedoed James Bond (Daniel Craig). And indeed, this 23rd Bond outing, superbly directed by the usually reliable Sam Mendes, does just that, pausing appropriately to settle down leisurely over a drink, for some flirtation, some tense verbal confrontation, some self-reflection and brooding just before cutting away to some clean-cut, thrilling action. The result is the uniquely named 'Skyfall' a Bond film so full of the vintage charm and charisma yet fashioned in modern, urban and instantly accessible style that it ends up being one of the finest films of the franchise.Yes, Mendes' film is a solid revamp of the Bond franchise, bringing in welcome dollops of humor, luxury and sensuality that went missing from the franchise with the last outing. And impressively enough, there is enough emotion without slowing things down, enough tension and action without making it too frenetic and the pacing is so, so perfect that you seldom feel the film falling short or dragging too long.Pretty much everyone would agree that the 60s were the heyday of the Bond films. Those Sean Connery-starrers were primarily all about the leading man and his ladies but each was fashioned with such a slick ease, wise-ass humor and layer-cakes of moments that we embraced them all as subversive classics. 'Skyfall' fortunately, is a film that reaches up to that caliber.Clearly, the best thing about the film is the pacing. Mendes is in no hurry to let the film unravel. The story begins in Istanbul, with Bond and his side-kick Eve Moneypenny (a sharp-tongued Naomie Harris, smarter than ever), chasing down a man with a list. The action scenes come in neatly and the opening pursuit shifts from a hectic bike chase on the rooftops to the cliff-hanging fight on top of the train and it all looks truly spectacular.The plot is simple enough- MI6 is under attack from a former agent- a renegade named Silva (Javier Bardem) who has a knack for orchestrating terrorist attacks with a simple click of the mouse. But trust me, this has to be one of the smoothest Bond outings in recent years; Mendes smartly and adroitly navigates the action from Istanbul to alternately grey and sunny London and from the stunning Shanghai to the villain's lair- ideally an abandoned island and finally in Bond's ancestral home in rural Scotland's foggy moors, setting the stage for a truly dramatic experience.And, boy, it delivers. For all the charm that it delivers, this has to be one of the most intimately dramatic Bond outing since ages. The plot is about how the ubiquitous computer can be used as a weapon for security breach but more importantly, this is a film that pairs both Bond and his nemesis in the same light- both are tortured souls, both were MI6 heroes who had been left for the dead in the name of protocol and duty and M, played superbly by Judi Dench, looms like a domineering matriarch over both the men. Silva's angst is against M's cold-blooded dedication to her duty, and Bond feels some of it as well but the latter clings to his morals out of loyalty to his nation. The stakes are downright personal and high and clearly each scene of action or searing tension feels immediate, urgent and the film gels with us on a personal level.But none of it jars. Smartly enough, everything is on an even keel- the action feels perfectly urgent but it does not stretch, the drama is poignant and painful, the humor comes in like a fresh breath into the taut proceedings and it all works impeccably as smoothly as the click of a mouse itself.'Skyfall' also proves quite what everyone is saying since 2006's 'Casino Royale- that Daniel Craig is the best Bond we had since Connery. This is a film where he is never as before- instead of the hardened, brutal action hero we were handed last time, here is a more relaxed Bond, clearly at greater ease, flirting with women and sparring with M and Q (an impressive Ben Whishaw) with equal dry charm and sarcasm. He makes his one-liners blaze and his quieter moments are played out with a subtlety. He rules the film without trying too hard. It is a solid, compelling act.And he is matched by the villain as well. Super performer Javier Bardem shows up in an unforgettable role as the menacing Silva, a man whom you might cringe at yet a character who stays with us as long as he is there in the film. He flips between smooth talking to a nasty edge with superb ease and his confrontation with Bond is clearly the highlight of the film. This is also an action film where the cinematographer also stands out. The work of veteran lens-man Roger Deakins is clearly one of the best things in this film. Deakins bathes each frame, from the action and suspense to the more reflective and emotional sequences with a fantastic play of light, shadow, shade, texture and perspective. Everything looks stunning, perfectly placed and in balance yet urgent and explosive.'Skyfall' is clearly a Bond film for the ages. The layer-cakes of vintage moments are perfectly underlined with a modern style- the scene between Q and Bond is a moment of self-reflexive humor, clearly revealing the generation gap between the two and the one between the new and the old Bond. Clearly, this is a film that has something for both the fans of old and fans of new. And that is a grandstanding achievement itself.Thank you, Daniel Craig. Thank You, Javier Bardem and thank you, Sam Mendes, for making me believe in James Bond again.Now, give us some more. Ah! It was worth the wait.": "Positive", "For a film that happens to be the 23rd installment in a movie franchise, the latest James Bond thriller, Skyfall, is surprisingly original. Though it marks the series' 50th anniversary by paying homage to many of the previous movies, Daniel Craig's third outing as 007 is unlike any Bond movie we've seen before.The surprises start early. At the end of an opening action sequence that may be the most elaborate ever (it's actually three or four action sequences rolled into one), we are hit with an unexpected twist that puts Her Majesty's top secret agent out of action. While he's sidelined, a terrorist begins targeting MI6 and its covert agents. Bond must struggle to get back in the game so he can set out to uncover who's behind the plot.What follows is a movie that turns the Bond formula inside-out. While there is an element of globetrotting, and exotic locales are definitely featured, much of the movie actually takes place in the U.K. That's just one of the ways this Bond movie zigs where most others have zagged. And, without giving too much away, the movie's finale is set-up as an almost mirror image of all those we've seen before.This is also a film that takes place in the real world. Buildings still blow up (it is a Bond movie after all). But when they do, we quickly see Wolf Blitzer reporting the explosion on CNN as breaking news. In this version of the Bond Universe, when things go wrong, M is called to testify before a committee hearing.The more plausible setting fits with Craig's take on the classic character. In his first two Bond films, he presented the secret agent as a real flesh and blood human being. You can believe this guy really exists. This time out, he takes that characterization even further. Not only do we get to see him made weakened and addled by the physical rigors of his job, but we also dig deeper into his back-story than ever before. If Casino Royale began a reboot of the series, then Skyfall completes the Bond \"origin story\". In this movie, we learn more about who Bond is and how he came to be the man he is today, than we did in all the previous 50 years of 007 flicks.Of course, most Bond movies are only as good as their villain, and Javier Bardem's Silva may not be simply the best Bond villain ever, he may rank pretty high on the all-time movie bad guy list, too. Bardem simply outdoes himself as an evil mastermind bent not on world domination, but rather, revenge. With Academy Award winning director Sam Mendes as a guide, the scenes between Craig and Bardem are engrossing to watch. It gives us something else we haven't really seen before in a Bond movie: two great actors going head-to-head.There are also Bond girls, naturally. Naomi Harris livens things up as a spunky field agent. And the gorgeous Berenice Marlohe plays the obligatory woman-with-a-tragic-past. But the real female lead this time is Judi Dench's M. She is in many ways front and center in a story that deals with loyalty, principles and the moral ambiguities of national defense in the terrorist age. In a non-romantic way, she is also Bond's true love interest this time around.Skyfall looks back on the first 50 years of Bond, then shows him to us again in a new light and sets him up nicely for his next 50 years. As they always say in the closing credits, \"James Bond Will Return\".": "Positive", "I really enjoyed the Bond reboot Casino Royale, and while it was less appreciated, my vague recollection is that I generally liked the follow up, but I was hugely disappointed with this film.There are a few good things. Javier Bardem does a great job as an unstable bad guy. Bond's flirtation with a fellow agent is kind of cute. The action scenes are pretty good; not mind blowing, but generally entertaining.Unfortunately, I was constantly frustrated by the plot, in which neither Bond nor anyone else (except the bad guy) ever does anything that makes the slightest bit of sense. The movie is just stupid, and the good in it never balanced the idiocy. I am actually amazed that a movie with such a terrible, terrible structure has gotten such rave reviews. For just some of the problems with the plot, read on:************** SPOILERS BELOW *****************First off, Bond twice waits until someone has died before fighting, even though in both cases his subsequent actions indicate he could have prevented the death. First, he calmly watches an assassination before attacking and killing the assassin. Even worse, he lets a woman he promised to help die (I knew she would from the moment he offered her help - I've seen Bond films before) and then takes out a bunch of bad guys even though nothing changes that makes it easier to take them out than when she was still alive.Then there's the moment when a supposed computer genius good guy (Q) hacks into the computer of the computer genius bad guy and takes zero precautions. He simply hooks the computer directly into the MI6 system. Who would do that who wasn't an idiot? The whole reason there are sandbox applications for running suspect software is because anyone who knows anything about computers knows you have to protect your system from threats.And when the bad guy escapes from a complex bristling with agents, how many people chase after him? One. Just Bond, by himself. No one tries to cover other exits, or chase at him from different directions. He really wouldn't have been that difficult to catch for any organization working together.The go-it-alone motif comes back at the end, where Bond lures the villain and his army to a remote location to take them out single- handedly. Why? Why not lure them into a trap made up of trained snipers. They're surrounded by flat land, it would actually be a pretty easy area to defend. I get angry all over again just writing all this down. There is no excuse for this much stupidity in one movie.": "Negative", "A respectable entry after the lackluster Quantum of Solace, Skyfall is propelled by two strong performances: Craig's ruthless Bond and Bardem's ghoulish supervillain Silva.Set-pieces are also vastly improved, although with the occasional misstep - a stupid, unexciting brawl next to Komodo dragons being the worst.Skyfall suffers from the \"bad guy with ludicrously complex plans\" syndrome, which exploded in modern action cinema after the memorable shenanigans of The Joker in The Dark Knight. Silva's impossible machinations all go off without a hitch and yet turn out to be an absurdly convoluted way to achieve revenge for someone who can blow up a building half a world away with a few clicks of his mouse.Good guys, on the other hand, are astoundingly thick. In the climactic finale, Bond and M lure Silva and his army to an isolated location and face them with no reinforcements aside for an old caretaker. I understand preventing civilian casualties, but why not bring, you know, MORE MI6 AGENTS? It's kind of their job. It makes no sense even for a series featuring henchmen with steel-capped teeth or deadly bowler hats.I am also doubtful about delving into Bond's past. It's fairly well done, but in these long-established sagas the protagonist's past is best left vague, imagining it being part of the implicit pact between creators and viewers. This isn't an origin story, and it isn't LOST: after 22 movies, I didn't need to see the hole young James crawled into when his parents died.6,5/10": "Positive", "A James Bond film made for the modern era, you'd be hard pressed to find any other film series able to stand the test of time and still feel relevant. When it looks like it's lagging behind the competition of the other spy action thrillers, the makers have taken note and re-invented the mould, making it more real and exciting.To me, Bond had too much of a rigid formula, the cars, the chases, the girls, the gadgets, the megalomaniac villain's and the spectacular set pieces/stunts. After a while though, the older films seem to suffer from a sense of deja vu. It's a case of been there, done that. The structure of the films have become stale and repetitive. Same plot about a group of criminals/organisation hell bent on world domination/destruction, with a beautiful bond girl in tow, Bond and or Bond girl gets capture, ridiculous car chase or stunts with a million of cheesy one liners. Frankly, I had pretty much given up on the Bond films. They have become predictable and tedious with only the change of location to give the film any sort of distinction.The plot of Skyfall is unlike previous Bond films, starts with the routine chase resulting in Bond being shot and wounded, believed to be dead by MI6. When an attack on MI6 headquarters manifest through a cyber attack and a bombing at the headquarters, Bond returns to uncover who is behind the assault. Struggling from his gun shot wound, Bond has to prove his fitness mentally and physically through some rigorous tests. Sent back into action without being fully fit, Bond embarks on the mission to expose the mastermind. What Bond discovers is a villain who happens to be ex-agent who has a vendetta against M and will stop at nothing to kill her.First thing you'll notice is the lack of gadgets and the usually bond girl (there is one of sorts but you'll understand when you watch it). Also with a villain who is suave yet as equally menacing as Hannibal Lector, we have a loose cannon who isn't after the world but revenge. It's spy vs spy and the story is more of a evolution of the characters that inhabit the world of Bond. Nods to older Bond films crop up from dialogue, props and even the classic Austin Martin car makes an appearance. It's a homage as well as a resurrection of well known characters.What we are given here is a Bond with more layers to him and more emotions. Daniel Craig has moulded a Bond who is more relateable. Signs of physical and emotional weakness shows us a Bond who is no longer a super spy with little or no vulnerability. Other characters are given more screen time and provide an emotion gravitas (We are also introduced to Q, a young model who is still wet behind the ears).In the hands of Sam Mendes and Director of photography Roger Deakins, there has never been a more beautiful shot Bond film. During Bond's fight with a criminal minion we see only their silhouettes, but the eye is drawn to the beauty of the neon Shanghai backdrop. The reserve can be said for the grime, dour and rainy streets of London which captures our the United Kingdom perfectly.It's a satisfying and enjoyable film, with plenty of action and a surprising emotional core to the narrative. A great development in characters with seeds being sown to allow for a more relateable and mature story telling and for future characters to come to the fore. Skyfall has made me fall in love with Bond films again so here's hoping there's no more rigid formula and routine mundane narratives of past.": "Positive", "There are so many things wrong with this movie. Most of the elements of a good Bond movie aren't there.The locations aren't well used. The Istanbul roof top &amp; Bazaar chase has already been shown in \"Taken 2\" and the TV show \"Missing\". Dejavu. The way they showed 'Shanghai' and 'Macau' at night it could have been filmed anywhere. The Scottish countryside shown was so grim.Where are the cars and gadgets? Nothing but the old Aston Martin. Just that pistol and tracker. The new Q is so ineffective. The villain played by Javier Bardem. He is more comical than sinister. With the blond fright wig, the campy overtures and the most frightening of all, the dentures this must the most absurd bad guy in Bond history.The climax feels cheap and conventional. They must have run out of money for the second half. Such a stupid idea to bring M to that run down Scottish house. With the home made defences and geriatric defenders, it felt like Home Alone meets the Golden Girls. Might as well have asked Betty White or grandma to join in. The new Bond girl Berenice Marlohe is exotic and fascinating to look at. But why only one? Writing her out of the show so early and not having another was a mistake. The Bond girl is supposed to end up saved by Bond with a hook up at the end. Unless you consider M a Bond girl.The focus of the movie is M. Judi Dench was always too provincial looking for MI6. The only good thing about this movie is that Ralph Fiennes is replacing her. Finally. There was no need to dedicate a whole movie to her farewell. Daniel Craig is just so haggard he looks worse than the villain. It's time to replace him with someone younger and handsomer. Baffled by the good reviews. Be warned we are being short changed.": "Negative", "After a botched MI6 operation in Istanbul, a lone mercenary, Patrice  (Ola Rapace), escapes with a computer file containing details about  undercover agents working within terrorist organisations. James Bond is  accidentally shot by his partner Eve (Naomie Harris) and believed to be  dead. Back in London, M (Judi Dench) finds her position threatened by  Gareth Mallory (Ralph Fiennes), who urges her to retire in the  aftermath of Istanbul. When the MI6 headquarters are bombed following a  threatening cyber-message to M, Bond returns, facing questions about  his mental state and his physical ability. But when Patrice is tracked  down, an assassination leads Bond to a casino in Macao, owned by cyber-  terrorist Raoul Silva (Javier Bardem), a former colleague of M's.  If I can say off the bat, I've always been in favour of this re-  invention of Bond. As the 'old' Bond films were progressing, they were  becoming gradually more ridiculous and fantasy-laden, leading to the  inexplicable invisible car in Pierce Brosnan's last film as Bond, Die  Another Day (2002). The films seemed to be losing sight of Ian  Fleming's source novels, and although they remained commercial hits,  Brosnan's outings (with the exception of GoldenEye (1995) were becoming  increasingly dire. Casino Royale set the tone early with a moody black-  and-white sequence that gave birth to Daniel Craig's colder, brutal  Bond, less concerned with how his Martini's were made than going to  extreme (and illegal) lengths to bring down his target(s). Royale's  reinvention showed a darker side to the beloved character, yet staying  with tradition, still kept him at an emotional distance.  Director Sam Mendes made the bold decision to reveal more about Bond's  past and childhood, risking fanboy wrath and damaging Bond's almost  mythical characterisations. The main crux of the film focuses on his  relationship with M, a stern authoritarian that risks career and her  own soul in putting national safety and the success of a mission above  the lives of her agents. Bond, being a willing soldier, follows M  blindly, and when Silva announces his intention to enact revenge on M  for a former betrayal, Bond takes M to his childhood home, Skyfall.  Bond facing his childhood allows time to develop on Bond's tormented  psyche, but it all seems quite out of place. One of the most intriguing  things about Bond is his almost suicidal willingness to risk all for  his job due to his almost complete lack of emotion, but Skyfall is  unable to make any grand revelations so it all comes to nothing more  than a distraction. (Saying that, the only previous Bond film to try  and engage Bond emotionally led to one of the most devastatingly cold  climaxes in the series' history in the underrated On Her Majesty's  Secret Service (1969)).  As well as the Bourne series, it seems that Christopher Nolan's Dark  Knight trilogy (2005-2012) is a major influence on this film in  particular. Mendes delves deeper into the workings and hierarchy of  MI6, rather than just a boss sat behind a desk, and adds a modern, more  'real' bad guy in Silva to the mix (even stealing the Joker's voluntary  arrest in The Dark Knight (2008)). Silva is a technical genius, able to  hack MI6's database with relative ease, and also proving himself more  resourceful and intelligent than Bond and M realise. Bardem is  wonderful in the role (as you would expect), but sadly his character is  not. Labelling him simply as a cyber virtuoso seems like a very lazy  way to allow Silva to repeatedly outwit MI6 and their own technical  marvel Q (Ben Whishaw) to the point where you wonder if Britain's  finest could really be so stupid. The film is therefore full of  plot-holes and distracting MacGuffin's that stretches out the running  time to more than it really needs to be.  Skyfall also asks a lot of the audience, especially when it comes to  suspending their belief. Before the frankly bizarre opening sequence  appears and we are treated to Adele's drab title song, we witness an  already wounded Bond get shot with a rifle and fall over 300 feet from  the Varda Viaduct into water, only to emerge alive and romancing a  mystery woman. No explanation is given as to how he manages to survive  the ordeal, and given the revelations about Bond's diminishing physical  prowess, it seems rather insulting. As questions are raised by his  superiors over Bond's ability to his job given his age (it must be the  grey in his stubble), Bond is put through various tests in which he  struggles with, yet half way through the film, this seems to be simply  put aside as he competently shoots and fights his way through various  bad guys. Again, no real explanation given.  Like I stated before, the most suitable word to describe this film  would be underwhelming, especially with the critical adoration that the  film was lavished with. The action scenes are dull, with nothing  matching the free-jumping opening of Royale. They are also quite  strange - was anyone expecting a henchman to be eaten by a CGI Komodo  dragon? How about death by underwater funky chicken? It all leads to a  very unsatisfying climax at Skyfall, where a simple shoot-out and foot  chase fail to justify a 2 hour-plus build-up. It feels like the entire  film is building up to an explosive climax that never comes. I found  the whole experiencing really quite baffling, with the attempts to mix  the old with the new Bond never really convincing or flowing. The film  is competently directed by Mendes however, and everything looks  suitably crisp and clean. What direction all of this means for Bond, I  don't know, but given the film is currently the 14th highest-grossing  film of all time, and the film somehow being lauded by critics and  audiences alike, it won't be too long until Craig dons the suit once  again.": "Negative", "Skyfall is a special James Bond Movie. Suddenly there was a 964 Astin Martin and Bond said \"we're going back in time\" to M, thats very neat. The story line has a car chase near the beginning, Bonds obituary shown in the trailer so no spoiler intended. There is Bonds road to recovery and testing. Bond thinks he passed by the skin of his teeth. The Villain brags that bond failed all of the tests, range, psychological, medical other. The bottom line is that the head of British Intelligence saw Bond as fit for the field. The screenplay is very good. One of my James Bond short stories was called Golden train with a fight on the top of a train tunnel and a sniper aiming at the train written in 2010. Commander James Bond celebrate 50 years of the Bond movie franchise with style the most successful movie franchise ever.": "Positive", "It's James Bond's 50th anniversary, and the 23rd Bond film, Skyfall, proves that there's still some bullets left in his Walter PPK. The plot of Skyfall is simplistic, a hard drive containing the identities of every secret agent embedded in terrorist organizations around the world is stolen, but it's how director Sam Mendes turns the film more so into a chess match than a whodunit, that marks this entry. The flamboyant villain, Silva, is an aggressive mastermind, manipulating the actions of MI6 through cyberterrorism, forcing M, MI6, and Bond to play defense the entire film, trying to keep out of checkmate, and in the end Bond and M retreat to Bond's boyhood home, Skyfall, to try to get Silva to drop his defenses.The thing about Skyfall, is that it is different than any other Bond film before it. It's a somber experience, almost melancholy. It's not cranked up to 11, it's not a simple bad guy wanting to take over the world story, in so many ways it's a character piece. The biggest action sequence is the Istanbul opening where 007 chases a bad guy across cars, motorcycles, and trains, and the rest of the film gets gradually smaller and smaller in scale, until all that is left are Bond, M, and Silva. It's the way their pasts come back to haunt them that is the spine of Skyfall. Bond still clings to the death of his parents, M is questioning her past decisions to sacrifice agents when the ends justified the means, and Silva is bitter over M having sacrificed him on a mission long ago, like she does with Bond in the opening. Unlike any other Bond film, it's about the relationships that these characters have with one another that shapes the narrative and the action. Bond's trust in M is tested, leading him down a certain path of action, but then it's reinforced, and then he stops at nothing to protect her from Silva. That is the true brilliance of Skyfall, it doesn't shy away from showing the humanity of these characters, or how their actions have repercussions, but rather it shows how they use those repercussions to carry on and finish the mission.Daniel Craig proves he is once more a more than capable 007, utilizing a dry sense of humor to deliver lines that Roger Moore would have hammed up. Like he did in Casino Royale, Craig finds a way to make Bond relatable and human to the audience. In the film, James Bond is portrayed as slightly older, having lost his edge, and not necessarily hip with the times where espionage is mostly done by computers and not field work. As a matter of fact, Bond is injured throughout most of the film, not at his physical peak, due to gunshot wounds sustained in the opening. Therefore, he's not really a superhero, but rather a human being who is constantly outmatched throughout the entire film, but as he proves by the end, it's not age or old school methods that define the job, but his commitment to see it through. As well, Judi Dench delivers her best turn since Goldeneye, Bond girl Naomie Harris really adds some much needed levity at times to keep things from getting too dark, and Ben Whishaw fills Desmond Llewelyn's shoes as Q. The true standout performance though is Javier Bardem as Silva. He's not just creepy or flamboyant, though he is a man whose sexuality is in question, but it's the way that he fully commits to the role that makes every line and action that he performs creepy and flamboyant. His performance has been likened to Heath Ledger's Joker, but I really think Silva is his own messed up breed that Bardem plays so brilliantly, perhaps besting his performance as Anton Chigurgh in No Country For Old Men. Not to mention, the fact that the script really builds up his character, where everyone talks about him in fear, with him manipulating in the shadows for the first half of the film, so that when we finally meet him, we're terrified of him.All in all, Skyfall is a marvel. Featuring superb action scenes, a traditional Bond theme song supplied by Adele, one of the better scripts ever written for a Bond film where every character has an arc and a purpose in the story, and some of the most stunning cinematography ever shot for an action flick, Skyfall is a home run. Not only that though, it's a great, personal film that is smart, tense, exciting, and surprisingly emotional. It uses the 50 year history of these characters to stir the emotions in the viewer, and in so many ways, if this isn't your first Bond film, you will be even more rewarded for it. But quite simply, the Bond family has outdone themselves here. Skyfall is a true blue James Bond adventure that surpasses nearly every other film in the storied franchise.I give Skyfall a 10 out of 10!": "Positive", "It is one thing to deconstruct a film genre, a genre that has reached the level of dynasty, to make it better. It is an entirely different matter to do so merely because you can, to show off your own power, and to leave the genre in tatters. Sam Mendes is incapable of making a film that is not dazzling to the eye. He is a visual artist of the highest calibre and possibly one of the greatest directors living today. Similarly the lead actors are incapable of delivering a performance that is less than stellar given the scripts they are handed. But the praise ends there. This is not a Bond film. This is an anti-Bond film. Notice kind reader that every task Bond is handed in the script ends in failure. Don't shoot the messenger, just watch the film. Notice that at some point Mendes became momentarily self-aware of what he was doing by bringing, out of nowhere, using the magic of film, the Aston Martin DB7 from a half-century ago, fully fuelled and ready to go, with the old Bond theme for accompaniment. But he just couldn't go through with it. The moment (the self-aware moment) passed and he went back to Plan A, the Anti-Bond film, and, in one of the most gratuitous but Freudian moments ever seen, blew the car to bits. Just like he blew the Bond formula to bits. I know what you are thinking. You thinking that an artist has license to do all this if the end result is entertaining and satisfying. True. But this film is as satisfying to the viewer as a car wreck. Visuals aside, it is hollow and leave a strange taste in the palate. Shame.": "Positive", "Like alot of Bond films this movie can drag, so let's get that out of the way first. The Villain is pretty lackluster, the film feels disjointed at times, and the third act plays out like Home Alone.": "Positive", "Skyfall has been deemed not only a very good Bond film, but also the best ever.I can certainly see where people are coming from with this view. It is well directed, has lots of action sequences and as with all of Daniel Craig's outings, manages to add more depth to the character.After their absences from the last two outings it is nice to see Moneypenny and Q back along for the ride (both with new faces) and Judi Dench is on good form as M.But the best Bond film ever? For me no. None of the action sequences will live long in the memory as being the best of the franchise and there are too many slow moments.So overall, a good Bond film,not a great one.": "Positive", "I began watching Bond films with \"Dr. No.\" I have been thrilled, disappointed, exhilarated, bored, and challenged. The best Bond movies are the ones that have a cohesion, despite the action sequences. There were times when I wondered if the producers packaged these by the pound. How many ridiculous chase scenes can you cram into a space. That's OK sometimes because these films have a sense of humor and an in-your-face craziness that is a hallmark. However, it's the space that may be a problem. The later films are just too long. When a confrontation takes twenty minutes to resolve, you need a program to try to remember the big picture. This one suffers from the same affliction. While things do eventually resolve themselves, we are led all over the place where distraction is the result. I must say that I stayed pretty interest throughout, but at times I began to look at my watch, wanting to cut to the chase. I like Daniel Craig. He seems to be a more complex Bond than some of the others, but the screenplays need editing and the action sequences more under control.": "Positive", "This is one of the best Bond movies I have ever seen. The story is superbly put together and has some interesting twists, the action is well done and contains none of the shaky cam which plagued the last film. The actors all do a great job. Some might still be put off by Daniel Craig's rough version of Bond, but I like it and he even has a few good old fashioned one-liners here. I wasn't sure about Javier Bardem as the villain at first. I thought he was a tad too flamboyant but eventually he grew on me, plus he had a very interesting backstory and as you might have guessed already, Judi Dench is fantastic as usual as M and she even has more to do in the story this time arround. This is not a completely formulaic Bond movie. Craig's bond is still more emotional than Connery or Moore ever were and for the first time we get some relatively detailed descriptions of his childhood. And something happens to Bond in the start of the movie that affects him for the rest of the film. But despite all that there are tons of James Bond trademarks like the martini, the introduction and even Q. Some might not like this new very young version of Q but I found him to be funny and very likable. They will never top Desmond Llewelyn's original performance, and instead of making a cheap Llewelyn clone, they make a completely different character which I think is the only right thing to do. This is not only a great Bond movie but just a downright great film.": "Positive", "The Short: Skyfall is exciting, tense, action packed and surprisingly beautiful. The perfect way to conclude 50 years of the incredible Bond legacy.Bond is back, baby.Skyfall is here; the highly anticipated next chapter in the much loved and respected Bond film legacy. And to much delight, Skyfall is no cash-in...this is a full fledged, action packed, and thoroughly conclusive Bond experience like no Bond film before it. Daniel Craig returns as the stoic James Bond, but this time he is a more vulnerable James Bond than before. The story takes Bond to and company to very interesting places, and the set pieces that follow are incredibly memorable (partly because of the superb cinematography). The finale is especially incredible; it oozes style. Judi Dench is as classic as ever, Ralph Fiennes is excellent, and Javier Bardem is an incredibly complex and sinister: he is equal parts flamboyant and insane. The only weak link here is Naomie Harris. Her introduction is far too brief to get the time to like the character, and her humor is pretty bad. She becomes better as the film moves along, but nothing to the level of past Bond girls. The action scenes are incredibly well shot and feature some of the best choreography since the Bourne trilogy. Like before, the finale is one of the best of the series, no doubt. It is explosive, intense, thoroughly satisfying and concludes a chapter in the Bond universe. The second half of the film also brings back some classic Bond ideas, and I'll keep it at that. If you have been in love with Bond series as long as I have, ever since childhood, you'll be giddy in your seat! The soundtrack is also really great, and the new music added fits the mood well. Adele's intro song is surprisingly good. Also, the classic intro scene style is back, and it is very, very cool. Now, Bond's latest isn't without some faults. Like mentioned before, Naomie Harris isn't great. Some of the humor is really hit or miss. There are a couple of small plot holes. All of these are little things, but keep this movie from being perfect. That being said, these things won't hurt the experience for all, and they do little to mar the overall experience.Summing up my feelings for Bond's latest is simple: Skyfall is such a good film. Aside from a few nagging little issues, Skyfall couldn't be better. It's filled with memorable action scenes, great characters, impressive cinematography and an unforgettable finale. It carries that same level of cheesiness that Bond films are well known for, and that same brand of humor is back. It's classic Bond in a new era, directed with expertise and style. Bond's latest mission is a success.4.5/5 - Fantastic, a must see.": "Positive", "As a lifelong James Bond enthusiast who has been extremely disappointed with the franchise's latest efforts (with the exception of Casino Royale), I was extremely pleased with this film. It strayed away from the storyline of the previous two films and I couldn't have been happier after the mediocrity of Quantum of Solace. This film has all the constituents from the Bond films that have preceded it. Big explosions, ridiculous stunts that not a single person in the history of humanity can survive, and let's not forget to mention the beautiful women that would make both genders stop and stare. So what does Skyfall have that the other Bond films don't? For the first time, we get a glimpse into our mysterious hero's dark past. Where he came from and what made him the person he is today. Although I've always been the one to say that Sean Connery is the greatest Bond ever, I can now confess that Daniel Craig now holds that honor. Sean plays the comedic, smooth, and witty Bond to perfection while Daniel plays the mysterious, dark, and lonesome secret agent flawlessly. I will always choose a darker portrayal over a comedic one because it takes a certain mindset to depict someone of that nature. One of my favorite scenes is where Bond is sitting in a bar drinking alone. I don't care who you are or what your background is, if you are drinking by yourself in a bar, then you have issues that are haunting you. Whether you can admit it or not, you are in a dark place and that is exactly where this Daniel Craig portrayed Bond is. And I love it.Aside from Daniel Craig, you have a cast that includes some of the finest actors that have ever graced the big screen. Javier Bardem plays a blood thirsty ex-MI6 agent out for revenge. His performance is equally as creepy and twisted as his portrayal of Anton Chigurh in \"No Country for Old Men\" and it is an Oscar worthy performance in my opinion. Judi Dench reprises her role as M and Ralph Fiennes and Albert Finney give important and memorable roles which I won't go further into detail about. Also two prominent figures from James bond history find their way back into the story line. Sam Mendes shows why he was the right choice to direct a film of this magnitude and along with the contribution of Oscar Nominee John Logan, Neal Purvis and Robert Wade come up with a memorable narrative after the disappointment of their last collaborating effort, Quantum of Solace. I look forward to what the future has in store for everyone's favorite spy. If Skyfall is a sign of things to come, then I will remain incredibly optimistic about the future.": "Positive"}, "sentiment": "Positive", "percentage": "80.0%", "color": "rgb(11, 241, 11)"}